# Примери за типът bool
print(True)
print(False)
print(10 > 9)
print(10 == 9)
print(10 < 9)

print(bool("Hello"))
print(bool(69))
# всичко, cast-нато към bool дава True, освен:
# 1) празни string-ове
# 2) 0
# 3) празни структури от данни (това ще го учим след 1-2 упражнения)
print(bool(False))
print(bool(None))
print(bool(0))


# условни оператори
x = 5
y = 12
print(x == y) # Equal
print(x != y) # Not equal
print(x > y)
print(x >= y)
print(x < y)
print(x <= y)
print(" ")


#логически оператори
x = 1
y = 2
z = 3
print(x < y and y < z)
print(x < y or y > z)
print(not(x > y or y < z))
print("")

# оператори за идентичност
print(x is y)
print(x is not y)
print("")



# оператори за съдържане
s = "Obicham da ucha vuv fmi!"
print("fmi" in s)
s = "Obicham da ucha vuv fmi!"
print("fmi" not in s)


print("")



# побитови операции
"""
    &   ->  логическо и
    |   ->  логическо или
    ^   ->  изключващо или
    ~   ->  логическо отрицание
    <<  ->  битшифт наляво   //   избутва всички битове в едно число наляво с една позиция и най-левия бит отпада
    >>  ->  битшифт надясно  //   избутва всички битове с една позиция надясно и най-десния бит отпада
"""

# побитово представяне на числа
"""
    1   ->  1
    2   ->  10
    3   ->  11
    15  ->  1111
    ...
"""



# <============ If... Else ============>

# синтаксисът е много важен, иначе ще имате компилационни грешки
"""
if <проверка>:
    <код>
<друг код>
"""

a = 15
b = 25
if a > b:
    print("Mrazim FMI")
print("shegichka")

if a < b:
    print("Obichame FMI")

# винаги на редът след if statement-а трябва да имате табулация навътре!

# Също така, всичко, което искаме да се изпълни ако условието е вярно,
# трябва да бъде в тялото на if-а (тоест една табулация навътре от if-а).



# Else statement
# ВИНАГИ преди else трябва да имате if!!!

a = 15
b = 15
if a > b:
    print("111")
else:
    print("222")



# Elif statement
# ползва се когато искате да направите повече от една проверка с if 

a = 15
b = 15
if a > b:
    print(1)
elif a < b:
    print(2)
elif a == b:            # забележете как ползваме  ==   а не   =   (операторът = ще опита да присвои стойност и програмата ще изведе грешка)
    print(3)



# можем да пишем if и на един ред - не е много четлив код, но ако имате просто един принт всичко е окей
if a > b: print("a is greater than b")


# както и можем if, else
print(a) if a > b else print(b)
# НО това вече е грозен код, така че се придържайте към това да го пишете на няколко реда


# if с повече от една проверка
a = 5
b = 10
c = 7
if(a < b and a < c and c < b):
    print("a < c < b")



# nested if
a = 20
if a > 10:
    print("a e по-голямо от 10")
    if a > 20:
        print("a e по-голямо от 20")
    else: 
        print("но не по-голямо от 20")
else:
    print("a не e по-голямо от 10")
 
# забележете табулациите! Те са много важни, за да ви работи програмата коректно! Винаги спазвайте табулациите!



# бърза задачка:
# напишете програма, която приема 3 стойности от потребителя -
# страни на триъгълник А,B,C и проверява дали те образуват истински
# триъгълник. (условие за триъгълник: А+B>C  A+C>B  B+C>A)