
# циклите са 2 типа : 
#   while цикли:
#       Състоят се от проверка и се изпълняват докато тази проверка се удовлетворява(true)
#   for цикли:
#       Използват се за итериране през някаква редица от елементи (масиви, редици, листи)
#       засега ще го ползваме за изпълняване на цикъля определен брой пъти


#пример за while цикъл
i = 0
while(i < 5):
    print(i)
    i+=1     #ВАЖНО - ако този ред го нямаше, цикълът ще продължава безкрайно, защото проверката винаги ще е true
# принтирахме само 0 1 2 3 4.
# какво да променим в кода за да принтираме числата от 0 до 5 включително?




# i = 5
# while(i < 500):
#     print(i)
#     i-=1
# защо този цикъл е безкраен?


#break statement в while цикъл
i = 0
while(i < 15):
    print(i)
    if(i == 10):
        break
    i+=1



#continue statement в while цикъл
i = 0
while(i < 15):
    i+=1
    if(i % 2 == 0):
        continue
    print(i)



# <========== for цикли ==========>
# пример за for цикъл
for i in range(6):
    print(i)
# 0 1 2 3 4 5

# range() е функция приемаща 3 аргумента:
# стартово число, крайно число, стъпка - точно като [] при string-ове
# стартовото число по default е 0
# крайното число винаги трябва да бъде зададено от нас, няма default-на стойност
# стъпката по default е 1, тоест на всяко достигане на проверката в цикъла, стойността на i се увеличава с 1-ца

# пример за range() със зададени стойности от нас
for i in range(15,250,3):
    print(i)
# ще принтира 15, 18, .... , 249  -  всички кратни числа на 3 между 15 и 250, изключвайки 250

# нека преведем този for цикъл във while цикъл: 
i = 15
while(i < 250):
    print(i)
    i+=3
# можем да запишем всеки for цикъл като while, но е много по-удобно да ползваме for
# тъй като при while циклите можем да забравим инкрементацията на i и да си крашнем програмата


# при for цилките също можем да ползваме break и continue
for i in range(500):
    if(i % 5 != 0): # i не се дели на 5 без остатък
        continue
    print(i)

for i in range(0, 500, 129):
    if(i == 258):
        break
    print(i)

# бърза задачка:
# напишете цикъл, който принтира числата от 0 до 1000, които се делят
# на 13.
# Сега напишете същият този цикъл използвайки стъпка, вместо if в тялото на цикъла
